[RM_Terror_Defence X2MissionTemplate]
+DisplayName="Defend Resistance Haven"
+Briefing="Defend Haven - ADVENT Siege"
+PostMissionType="Defend Resistance Haven"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="Neutralize all enemy targets or evac after primary objective completion"
+ObjectiveTextPools[1]="Defend haven long enough for non-combatants to evacuate"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Unique.Central_Unique_Missions_Terror_Attack"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Unique.T_Unique_Missions_Terror_Attack_Central_05"
+PreMissionNarratives[5]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_01"
+PreMissionNarratives[6]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_02"
+PreMissionNarratives[7]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_03"
+PreMissionNarratives[8]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_04"
+PreMissionNarratives[9]="X2NarrativeMoments.TACTICAL.Terror.T_Terror_Narrative_Wrappers_05"

[RM_GuerillaOp_Neutralize X2MissionTemplate]
+DisplayName="Neutralize ADVENT VIP on PR Tour"
+Briefing="Neutralize ADVENT VIP"
+PostMissionType="Neutralize ADVENT VIP on PR Tour"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="Capture or Kill Enemy VIP"
+ObjectiveTextPools[1]="WARNING: ADVENT will go on high alert if the VIP's lifesigns go null"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_01"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.Neutralize.Central_Council_Missions_Neutralize_Target_05"

[RM_Council_RescueVIP X2MissionTemplate]
+DisplayName="Rescue VIP from Rioting City"
+Briefing="Rescue VIP from Rioting City"
+PostMissionType="Extract VIP"
+BriefingImage="img:///UILibrary_Common.Xcom_default"
+ObjectiveTextPools[0]="Rescue VIP from ADVENT custody"
+ObjectiveTextPools[1]="Resistance provocateurs have started riots at key city locations to distract ADVENT"
+ObjectiveTextPools[2]="But Firebrand will need to temporarily leave the area when the VIP is secured"
+PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_01"
+PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_02"
+PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_03"
+PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_04"
+PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.RescueVIP.Central_Council_Missions_Rescue_VIP_05"


[MissionTimers]
+TimerTerrorDefenceTitle="Haven Evacuation"
+TimerTerrorDefenceSubtitle="Turns until completion"
+TimerGuerillaVIPTitle="Firebrand's Return"
+TimerGuerillaVIPSubtitle="Turns until arrival"

[RM_Terror_Defence X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="Defend against ADVENT siege"
+ObjectiveTextPools[1]="Neutralize all enemy targets"
+ObjectiveTextPools[2]="Extract all XCOM soldiers"

[RM_GuerillaOp_Neutralize X2MissionNarrativeTemplate]
+ObjectiveTextPools[0]="Hold out until Firebrand's back in AO"
+ObjectiveTextPools[1]="Capture or kill ADVENT VIP"
+ObjectiveTextPools[2]="Extract ADVENT VIP"
+ObjectiveTextPools[3]="Extract all XCOM soldiers"

[RM_Council_RescueVIP X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="Hold out until Firebrand returns to AO"
ObjectiveTextPools[1]="Secure VIP from ADVENT Prison"
ObjectiveTextPools[2]="Extract the VIP"
ObjectiveTextPools[3]="Extract all XCOM soldiers"


[Tech_ArmPlatedArmor X2TechTemplate]
DisplayName="Resistance-produced Plated Armor"
Summary="Now that we have experience with salvaging the ADVENT armors we've recovered for our own plated armors, we should be able to make detailed blueprints for resistance cells to use to equip their fighters with equivalent armour. Should be helpful on missions with resistance fighters."

[Tech_ArmMagWeapons X2TechTemplate]
DisplayName="Resistance-produced Magnetic Weapons"
Summary="Now that we have experience with re-constructing ADVENT's magnetic weapons, we should be able to make detailed blueprints for resistance cells to use to equip their fighters with equivalent weapons. Should be helpful on missions with resistance fighters."


[Tech_ArmPlasmaGrenade X2TechTemplate]
DisplayName="Resistance-produced Plasma Grenades"
Summary="Now that we have working knowledge of how the aliens' grenades work, we should be able to make detailed blueprints for resistance cells to create relatively equal equipment, though we'll need to provide the elerium dust. Should be helpful on missions with resistance fighters."

[Tech_ArmPoweredArmor X2TechTemplate]
DisplayName="Resistance-produced Powered Armor"
Summary="With the ever-growing strength of the aliens, even plated armour and magnetic weapons may not be able to cut it. While this will be an ardous task, Shen and I may be able to find out a way for resistance cells to produce their own powered armor."
CodeName="Stark"
LongDescription="Despite the immense difficulties involved considering the lack of quality supplies the average resistance cell has, we've managed to successfully create a blueprint for creating Elerium-based power armor for usage in the field. A resistance fighter equipped with this should be able to go far in the field. R. Tygan."


[Tech_ArmBeamRifles X2TechTemplate]
DisplayName="Resistance-produced Plasma Rifles"
Summary="With the ever-growing strength of the aliens, even plated armour and magnetic weapons may not be able to cut it. While this will be an ardous task, Shen and I may be able to find out a way for resistance cells to produce their own plasma rifles."
CodeName="Laser Squad"
LongDescription="Despite the problems we've faced considering most resistance cells lack the good supplies we're used to, me and Tygan managed to successfully make a blueprint for creating plasma weaponry. Any resistance fighters equipped with these babies should be able to give ADVENT a run for their money in the field. L. Shen."